Repository: Non-Human69/Fibonacci-Web-App
Catalog: Data/SharedResources.*.resx
Languages: nl

# HomeLead
source: Explore Fibonacci numbers â€” check if a value is Fibonacci, get a Fibonacci value by index, build numbers from Fibonacci combinations, or list Fibonacci numbers in a range and their sum.
nl: Ontdek Fibonacci-getallen â€” controleer of een waarde Fibonacci is, haal een Fibonacci-waarde op via index, bouw getallen uit Fibonacci-combinaties of lijst Fibonacci-getallen in een bereik en hun som.

# Button_CheckNumber
source: Check a Number
nl: Controleer een getal

# Button_GetByIndex
source: Get by Index
nl: Ophalen op index

# Button_Combination
source: Combination
nl: Combinatie

# Button_RangeSum
source: Range & Sum
nl: Bereik & Som

# QuickFactsTitle
source: Quick facts
nl: Snel feiten

# QuickFact1
source: Razor Pages with a clean UI
nl: Razor Pages met een eenvoudige UI

# QuickFact2
source: Big integers supported up to index 9999
nl: Grote gehele getallen ondersteund tot index 9999

# QuickFact3
source: Biggest possible number: Duocenti-novemdecillion
nl: Grootste mogelijke getal: Duocenti-novemdecillion

# QuickFact4
source: This is a number with 616 zeros
nl: Dit is een getal met 616 nullen

# Card_CheckTitle
source: Check Fibonacci
nl: Fibonacci controleren

# Card_CheckText
source: Quickly determine whether a number is part of the Fibonacci sequence.
nl: Snel bepalen of een getal deel uitmaakt van de Fibonacci-reeks.

# Card_CheckButton
source: Go to Checker
nl: Naar de controle

# Card_GetTitle
source: Get by Index
nl: Ophalen op index

# Card_GetText
source: Retrieve the Fibonacci number at a given index (supports large indices with BigInteger).
nl: Haal het Fibonacci-getal op op een gegeven index (ondersteunt grote indices met BigInteger).

# Card_GetButton
source: Get Number
nl: Haal op

# Card_CombinationTitle
source: Combination
nl: Combinatie

# Card_CombinationText
source: Find which Fibonacci numbers combine to form a target value (Zeckendorf-style).
nl: Vind welke Fibonacci-getallen bij elkaar opgeteld het doel vormen (Zeckendorf-stijl).

# Card_CombinationButton
source: View Combination
nl: Bekijk combinatie

# Card_RangeTitle
source: Range & Sum
nl: Bereik & Som

# Card_RangeText
source: List Fibonacci numbers in a range and compute their sum.
nl: Toon Fibonacci-getallen in een bereik en bereken hun som.

# Card_RangeButton
source: Explore Range
nl: Bekijk bereik
